/*
 *  === Числа и условия, задача 9:
 *
 *  Если n отрицательное, то ничего не писать.
 *  Если меньше 60, написать: "Прошло %d минут.\n"
 *  Если 60 или больше, то написать: "Прошло %d часов %d минут.\n"
 *
 *  Нужно, чтобы программа всегда писала грамотно с точки зрения русского языка.
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void)
{
    // Запрашиваем число
    int n;
    do
    {
    n = get_int("Сколько прошло минут? ");
    }
    while (n<1);

    // Решение задачи:
    if (n<60)
    {
        if (n%100>=11 && n%100<=19)
        {
        printf("Прошло %d минут.\n", n);
        }
        else if (n%10 == 1)
        {
        printf("Прошла %d минута.\n", n);
        }
        else if (n%100==2 || n%100==3 || n%100==4)
        {
        printf("Прошло %d минуты.\n", n);
        }
        else
        {
         printf("Прошло %d минут.\n", n);
        }
    
    }




    else if (n>=60)
    {
        int h = n/60;
        int m = n%60;

        if (h%100>=11 && h%100<=19)
        {
         printf("Прошло %d часов", h);
         }

        else if (h%10 == 1)
        {
        printf("Прошел %d час", h);

        }
        else if (h%100==2 || h%100==3 || h%100==4)
        {
         printf("Прошло %d часа", h);

        }
        else
        {
          printf("Прошло %d часов", h);

        }

        if (m%100>=11 && m%100<=19)
        {
             printf(" %d минут.\n", m);
        }
         else if (m%10==2 || m%10==3 || m%10==4)
         {
             printf(" %d минуты.\n", m); 
         }
        else if (m==0)
        {
            printf(" %d минут\n", m);
        }
         else if (m%10 == 1)
         {
             printf(" %d минута.\n", m);
         }
    
          else
          {
               printf(" %d минут.\n", m); 
          }
         

    

        
    }


}
