/*
 *  === Числа и условия, задача 8:
 *
 *  Если n отрицательное или больше 120, написать "Возраст человека таким не бывает.\n"
 *  Иначе напиcать "Вам %d лет.\n" или "Вам %d года.\n" или "Вам %d год.\n".
 *
 *  Нужно, чтобы вывод всегда был правильный с точки зрения русского языка, например:
 *  "Вам 32 года.", "Вам 100 лет." или "Вам 1 год.".
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void)
{
    // Запрашиваем число
    int n = get_int("Сколько вам лет? ");

    // Решение задачи:

}
