/*
 *  === Числа и условия, задача 10:
 *
 *  Если n отрицательное, то ничего не писать.
 *  Если число меньше 60 написать "Прошло %d минут.\n"
 *  Если число 60 или больше написать "Прошло %d часов %d минут.\n"
 *  Если получилось 24 или больше часов, написать "Прошло %d суток %d часов %d минут.\n"
 *
 *  Нужно, чтобы программа всегда писала грамотно с точки зрения русского языка.
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void)
{
    // Запрашиваем число
    int n = get_int("Сколько прошло минут? ");

    // Решение задачи:

}
