/*
 *  Числа и условия, задача 4:
 *
 *  Если n равно 1, написать "Это единица.\n"
 *  Если n равно 2, написать "Это двойка.\n"
 *  Если n равно 3, написать "Это тройка.\n"
 *  Если n равно 4, написать "Это четвёрка.\n"
 *  Если n равно 5, написать "Это пятёрка.\n"
 *  Иначе написать "Это не похоже на оценку по пятибальной шкале.\n"
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void) 
{
    // Запрашиваем число
    int n = get_int("Сколько баллов вам поставили? ");

    // Решение задачи:

}
