/*
 *  === Числа и условия, задача 7:
 *
 *  Список из десяти вопросов (можно выбрать любые другие):
 *
 *    "Сколько часов в сутках? "
 *    "Сколько дней в високосном году? "
 *    "Сколько на Земле континентов? "
 *    "Дюжина -- это сколько? "
 *    "Сколько дней в апреле? "
 *    "Сколько лап у кота? "
 *    "Сколько штатов в США? "
 *    "В каком году появился первый iPhone? "
 *    "Рубль -- это сколько копеек? "
 *    "В каком году основали Москву? "
 *
 *  Программа по очереди задаёт вопросы и после каждого вопроса проверяет ответ.
 *
 *  В зависимости от результата проверки, программа пишет:
 *    "Правильно!\n", если ответ правильный, или
 *    "Правильный ответ: %d.\n", если ответ не такой.
 *
 *  В конце программа должна написать:
 *    "Число правильных ответов: %d из 10\n."
 */

#include<stdio.h>
#include<cs50.h>

int main(void)
{
    // Решение

}
