/*
 *  === Числа и условия, задача 6:
 *
 *  Год високосный, когда он делится на 4.
 *  Например 1980, 1984 и 2004 -- високосные, а 1977, 1986 и 2001 -- невисокосные.
 *
 *  Исключение делается для годов, которые делятся на 100. Они високосные только
 *  тогда, когда делятся на 400. Например, 2000 и 1600 -- високосные года, а
 *  1700, 1800 и 1900 -- невисокосные года.
 *
 *  В високосном году всегда 366 дней, а в невисокосном -- 365.
 *
 *  Пользователь вводит год, а программа должна ответить, сколько в нём дней.
 *
 *  Например: "В %d году 365 дней.\n" или "В %d году 366 дней.\n"
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void)
{
    // Запрашиваем у пользователя число
    int n = get_int("Введите год: ");

    // Решение задачи:

}
