/*
 *  === Числа и условия, задача 10:
 *
 *  Если n отрицательное, то ничего не писать.
 *  Если меньше 60, написать: "Прошло %d минут.\n"
 *  Если 60 или больше, то написать: "Прошло %d часов %d минут.\n"
 *  Если получилось 24 или больше часов, то: "Прошло %d суток %d часов %d минут.\n"
 *
 *  Нужно, чтобы программа всегда писала грамотно с точки зрения русского языка.
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void)
{
    int n;
    do
    {
    n = get_int("Сколько прошло минут? ");
    }
    while (n<1);

    // Решение задачи:
    if (n<60)
    {
        if (n%100>=11 && n%100<=19)
        {
        printf("Прошло %d минут.\n", n);
        }
        else if (n%10 == 1)
        {
        printf("Прошла %d минута.\n", n);
        }
        else if (n%10==2 || n%10==3 || n%10==4)
        {
        printf("Прошло %d минуты.\n", n);
        }
        else
        {
         printf("Прошло %d минут.\n", n);
        }
    
    }


       else if (n>=1440)
         {
           int H = n/60;
           int m = n%60;
           int d = H/24;
           int h = H%24;
         if (d%100>=11 && d%100<=19)
        {
         printf("Прошло %d дней", d);
         }
        else if (d%10 == 1)
        {
        printf("Прошел %d день", d);

        }
        else if (d%10==2 || d%10==3 || d%10==4)
        {
         printf("Прошло %d дня", d);

        }
        else
        {
          printf("Прошло %d дней", d);
        }

         if (h%100>=11 && h%100<=19)
        {
         printf(" %d часов", h);
         }

        else if (h%10 == 1)
        {
        printf(" %d час", h);

        }
        else if (h%10==2 || h%10==3 || h%10==4)
        {
         printf(" %d часа", h);

        }
        else
        {
          printf(" %d часов", h);

        }

        if (m%100>=11 && m%100<=19)
        {
             printf(" %d минут.\n", m);
        }
         else if (m%10==2 || m%10==3 || m%10==4)
         {
             printf(" %d минуты.\n", m); 
         }
        else if (m==0)
        {
            printf(" %d минут\n", m);
        }
         else if (m%10 == 1)
         {
             printf(" %d минута.\n", m);
         }
    
          else
          {
               printf(" %d минут.\n", m); 
          }
         
         }  


    else if (n>=60)
    {
        int h = n/60;
        int m = n%60;

        if (h%100>=11 && h%100<=19)
        {
         printf("Прошло %d часов", h);
         }

        else if (h%10 == 1)
        {
        printf("Прошел %d час", h);

        }
        else if (h%10==2 || h%10==3 || h%10==4)
        {
         printf("Прошло %d часа", h);

        }
        else
        {
          printf("Прошло %d часов", h);

        }

        if (m%100>=11 && m%100<=19)
        {
             printf(" %d минут.\n", m);
        }
         else if (m%10==2 || m%10==3 || m%10==4)
         {
             printf(" %d минуты.\n", m); 
         }
        else if (m==0)
        {
            printf(" %d минут\n", m);
        }
         else if (m%10 == 1)
         {
             printf(" %d минута.\n", m);
         }
    
          else
          {
               printf(" %d минут.\n", m); 
          }
         
         
 
    }


}
