/*
 *  Числа и условия, задача 7:
 *
 *  Написать "Сколько часов в сутках? "
 *  Если ввели 24, то написать "Правильно!\n",
 *  если же ввели другое число, написать "Правильный ответ: %d.\n".
 *
 *  Затем задать ещё девять вопросов, например (можно выбрать любые другие):
 *    "Сколько дней в високосном году? " 
 *    "Сколько на Земле континентов? "
 *    "Дюжина -- это сколько? "
 *    "Сколько дней в апреле? "
 *    "Сколько лап у кота? "
 *    "Сколько штатов в США? "
 *    "В каком году появился первый iPhone? "
 *    "Рубль -- это сколько копеек? "
 *    "В каком году основали Москву? "
 *
 *  После каждого вопроса писать "Правильно!\n" или "Правильный ответ: %d.\n"..
 *  А в конце написать: "Число правильных ответов: %d из 10\n."
 */

#include<stdio.h>
#include<cs50.h>

int main(void) 
{
    // Решение

}
