/*
 *  === Числа и условия, задача 5:
 *
 *  Если n от 1401 до 1500 включительно, написать: "Это XV век.\n"
 *    от 1501 до 1600: "Это XVI век.\n"
 *    от 1601 до 1700: "Это XVII век.\n"
 *    от 1701 до 1800: "Это XVIII век.\n"
 *    от 1801 до 1900: "Это XIX век.\n"
 *    от 1901 до 2000: "Это XX век.\n"
 *    от 2001 до 2100: "Это XXI век.\n"
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void)
{
    // Запрашиваем у пользователя число
    int n = get_int("Введите год: ");

    // Решение задачи:

}
