/*
 *  Числа и условия, задача 5:
 *
 *  Если n от 1401 до 1500 включительно, написать "Это XV век.\n"
 *         от 1501 и 1600: "Это XVI век.\n"
 *         от 1601 и 1700: "Это XVII век.\n"
 *         от 1701 и 1800: "Это XVIII век.\n"
 *         от 1801 и 1900: "Это XIX век.\n"
 *         от 1901 и 2000: "Это XX век.\n"
 *         от 2001 и 2100: "Это XXI век.\n"
 *
 */

#include<stdio.h>
#include<cs50.h>

int main(void) 
{
    // Запрашиваем у пользователя число
    int n = get_int("Введите год: ");

    // Решение задачи:

}
